/******************************************************************************/
/*! @file       Bullet.h
    @brief      弾クラス定義ファイル
*******************************************************************************/

#ifndef BULLET_H
#define BULLET_H

#include "GameObject.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class CBullet
        @brief  弾クラス
    *******************************************************************************/
    class CBullet : public CGameObject
    {
    protected:
        /*! 弾の移動速度 */
        MyFloat m_SpeedX;
        MyFloat m_SpeedY;

        /*! 弾角度 */
        MyFloat m_Angle;

        /*! 画像ID */
        MyInt   m_Image;

    public:

        /******************************************************************************/
        /*! コンストラクタ
        *******************************************************************************/
        CBullet();

        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~CBullet() override;

        /******************************************************************************/
        /*! 弾の初期化
            @param[in]      px    初期位置Ｘ
            @param[in]      py    初期位置Ｙ
            @param[in]      sx    スピードＸ
            @param[in]      sy    スピードＹ
            @param[in]      iw    画像幅
            @param[in]      ih    画像高さ
            @param[in]      img   画像ＩＤ
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Initialize(MyFloat px, MyFloat py, MyFloat sx, MyFloat sy, MyS32 iw, MyS32 ih, MyInt img);

        /******************************************************************************/
        /*! 弾の更新
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Update() override;

        /******************************************************************************/
        /*! 弾の描画
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Draw() override;
    };

    /*! ポインタ置き換え */
    using BulletPtr  = std::shared_ptr<CBullet>;
    using BulletList = std::list<BulletPtr>;
}

#endif //BULLET_H
