/******************************************************************************/
/*! @file       GameApplication.cpp
    @brief      ゲームアプリケーションクラス実装ファイル
*******************************************************************************/
#include "GameApplication.h"

using namespace Shooting2D;

/******************************************************************************/
/*! アプリケーションの初期化
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameApplication::Initialize()
{
    if (m_Scene.Load() != k_Success) { return k_failure; }
    if (m_Scene.Initialize() != k_Success) { return k_failure; }
    return k_Success;
}

/******************************************************************************/
/*! アプリケーションの更新
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameApplication::Update()
{
    m_Scene.Update();
    return k_Success;
}

/******************************************************************************/
/*! アプリケーションの描画
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameApplication::Draw()
{
    m_Scene.Draw();
    return k_Success;
}

/******************************************************************************/
/*! アプリケーションの解放
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameApplication::Release()
{
    m_Scene.Release();
    return k_Success;
}

