/******************************************************************************/
/*! @file       GameScene.cpp
    @brief      ゲームシーンクラス実装ファイル
*******************************************************************************/
#include "GameScene.h"

using namespace Shooting2D;

/******************************************************************************/
/*! コンストラクタ
*******************************************************************************/
CGameScene::CGameScene()
        : IScene()
        , m_Player()
        , m_BackGround()
{
}

/******************************************************************************/
/*! デストラクタ
*******************************************************************************/
CGameScene::~CGameScene()
{
}

/******************************************************************************/
/*! シーンの読み込み
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameScene::Load()
{
    // プレイヤーの読み込み
    if (m_Player.Load() != k_Success) { return k_failure; }
    // 背景の読み込み
    if (m_BackGround.Load() != k_Success) { return k_failure; }

    return k_Success;
}

/******************************************************************************/
/*! シーンの初期化
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameScene::Initialize()
{
    // プレイヤーの初期化
    m_Player.Initialize();
    // 背景の初期化
    m_BackGround.Initialize();

    return k_Success;
}

/******************************************************************************/
/*! シーンの更新
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameScene::Update()
{
    // 背景の更新
    m_BackGround.Update();
    // プレイヤーの更新
    m_Player.Update();

    return k_Success;
}

/******************************************************************************/
/*! シーンの描画
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameScene::Draw()
{
    // 背景の描画
    m_BackGround.Draw();
    // プレイヤーの描画
    m_Player.Draw();

    return k_Success;
}

/******************************************************************************/
/*! シーンの解放
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CGameScene::Release()
{
    // 背景の解放
    m_BackGround.Release();
    // プレイヤーの解放
    m_Player.Release();

    return k_Success;
}