/******************************************************************************/
/*! @file       MissionFlag.h
    @brief      ミッションフラグクラス定義ファイル
*******************************************************************************/

#ifndef MISSIONFLAG_H
#define MISSIONFLAG_H

#include <memory>
#include "Common.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class IMissionFlag
        @brief  ミッションフラグクラス
    *******************************************************************************/
    class IMissionFlag
    {
    public:

        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~IMissionFlag() = default;

        /******************************************************************************/
        /*! 有効フラグの取得
            @return         有効フラグ
        *******************************************************************************/
        virtual MyBool IsValid() const noexcept = 0;
    };

    /*! ポインタ置き換え */
    using MissionFlagPtr = std::shared_ptr<IMissionFlag>;
}

#endif //MISSIONFLAG_H
