/******************************************************************************/
/*! @file       MoveSimple.h
    @brief      移動クラス定義ファイル
*******************************************************************************/

#ifndef MOVESIMPLE_H
#define MOVESIMPLE_H

#include "Move.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class CMoveSimple
        @brief  移動クラス
    *******************************************************************************/
    class CMoveSimple : public IMove
    {
    protected:

        /*! 移動速度 */
        MyFloat m_SpeedX;
        MyFloat m_SpeedY;

    public:

        /******************************************************************************/
        /*! コンストラクタ
            @param[in]  sx     移動速度X
            @param[in]  sy     移動速度Y
        *******************************************************************************/
        explicit CMoveSimple(MyFloat sx, MyFloat sy);

        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~CMoveSimple() override;

        /******************************************************************************/
        /*! 更新
            @param[in,out]  px    移動させる座標X
            @param[in,out]  py    移動させる座標Y
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Update(MyFloat& px, MyFloat& py) override;

        /******************************************************************************/
        /*! 移動速度Xの取得
            @return         移動速度X
        *******************************************************************************/
        virtual const MyFloat GetSpeedX() const noexcept override
        {
            return m_SpeedX;
        }

        /******************************************************************************/
        /*! 移動速度Yの取得
            @return         移動速度Y
        *******************************************************************************/
        virtual const MyFloat GetSpeedY() const noexcept override
        {
            return m_SpeedY;
        }
    };
}

#endif //MOVESIMPLE_H
