/******************************************************************************/
/*! @file       SceneChangeEffect.h
    @brief      シーン変更クラス定義ファイル
*******************************************************************************/

#ifndef SCENECHANGEEFFECT_H
#define SCENECHANGEEFFECT_H

#include "Scene.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class IScene
        @brief  シーン変更インターフェース
    *******************************************************************************/
    class ISceneChangeEffect
    {
    public:
        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~ISceneChangeEffect() = default;

        /******************************************************************************/
        /*! 更新
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Update() = 0;

        /******************************************************************************/
        /*! 描画
            @param[in]      prev          前シーン
            @param[in]      prevImg       前シーン用画像ID
            @param[in]      current       現在のシーン
            @param[in]      currentImg    現在のシーン用画像ID
            @return         成功 k_Success, 失敗 それ以外
        *******************************************************************************/
        virtual MyS32 Draw(ScenePtr& prev, MyInt prevImg, ScenePtr& current, MyInt currentImg) = 0;

        /******************************************************************************/
        /*! シーン終了フラグ
            @return         シーン終了フラグ
        *******************************************************************************/
        virtual MyBool IsEnd() const noexcept = 0;
    };
    /*! ポインタ置き換え */
    using SceneChangeEffectPtr = std::shared_ptr<ISceneChangeEffect>;
}

#endif //SCENECHANGEEFFECT_H
