/******************************************************************************/
/*! @file       SceneRegister.h
    @brief      シーン登録クラス定義ファイル
*******************************************************************************/

#ifndef SCENEREGISTER_H
#define SCENEREGISTER_H

#include "SceneCreator.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class ISceneRegister
        @brief  シーン登録クラスインターフェース
    *******************************************************************************/
    class ISceneRegister
    {
    public:
        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~ISceneRegister() = default;

        /******************************************************************************/
        /*! シーンの登録
            @param[in]      key          登録シーンキー
            @param[in]      creator      生成シーン
        *******************************************************************************/
        virtual MyVoid Regist(RKMy(SceneKey) key, SceneCreatorPtr creator) = 0;
    };
    /*! ポインタ置き換え */
    using SceneRegisterPtr = std::shared_ptr<ISceneRegister>;
}

#endif //SCENEREGISTER_H
