/******************************************************************************/
/*! @file       SceneCreator.h
    @brief      シーン生成クラス定義ファイル
*******************************************************************************/

#ifndef SCENECREATOR_H
#define SCENECREATOR_H

#include "Scene.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class ISceneCreator
        @brief  シーン生成クラスインターフェース
    *******************************************************************************/
    class ISceneCreator
    {
    public:

        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~ISceneCreator() = default;

        /******************************************************************************/
        /*! シーンの生成
            @return         生成されたシーンクラス
        *******************************************************************************/
        virtual ScenePtr Create() = 0;
    };
    /*! ポインタ置き換え */
    using SceneCreatorPtr = std::unique_ptr<ISceneCreator>;
}

#endif //SCENECREATOR_H
