/******************************************************************************/
/*! @file       SceneChanger.h
    @brief      シーン変更クラス定義ファイル
*******************************************************************************/

#ifndef SCENECHANGER_H
#define SCENECHANGER_H

#include "Scene.h"
#include "SceneChangeEffect.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class ISceneChanger
        @brief  シーン変更インターフェース
    *******************************************************************************/
    class ISceneChanger
    {
    public:
        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~ISceneChanger() = default;

        /******************************************************************************/
        /*! 更新
            @param[in]      key          変更先シーンキー
            @return         true 成功, false 失敗
        *******************************************************************************/
        virtual MyBool Change(RKMy(SceneKey) key) = 0;

        /******************************************************************************/
        /*! 更新
            @param[in]      key          変更先シーンキー
            @param[in]      effect       変更エフェクト
            @return         true 成功, false 失敗
        *******************************************************************************/
        virtual MyBool Change(RKMy(SceneKey) key, SceneChangeEffectPtr effect) = 0;
    };
    /*! ポインタ置き換え */
    using SceneChangerPtr = std::shared_ptr<ISceneChanger>;
}

#endif //SCENECHANGER_H
