/******************************************************************************/
/*! @file       TurretCreator.h
    @brief      砲台生成機クラス定義ファイル
*******************************************************************************/

#ifndef TURRETCREATOR_H
#define TURRETCREATOR_H

#include "Turret.h"

namespace Shooting2D
{
    /******************************************************************************/
    /*! @class ITurretCreator
        @brief  砲台生成機クラス
    *******************************************************************************/
    class ITurretCreator
    {
    public:
        /******************************************************************************/
        /*! デストラクタ
        *******************************************************************************/
        virtual ~ITurretCreator() = default;

        /******************************************************************************/
        /*! 砲台の生成
            @return         生成された砲台のポインタ
        *******************************************************************************/
        virtual TurretPtr Create() = 0;
    };

    /*! ポインタ置き換え */
    using TurretCreatorPtr = std::shared_ptr<ITurretCreator>;
}

#endif //TURRETCREATOR_H
