/******************************************************************************/
/*! @file       TurretArray.cpp
    @brief      タレット配列管理処理クラス実装ファイル
*******************************************************************************/

#include "TurretArray.h"

using namespace Shooting2D;

/******************************************************************************/
/*! コンストラクタ
*******************************************************************************/
CTurretArray::CTurretArray()
    : m_TurretArray()
{
}

/******************************************************************************/
/*! デストラクタ
*******************************************************************************/
CTurretArray::~CTurretArray()
{
}

/******************************************************************************/
/*! 初期化
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CTurretArray::Initialize()
{
    MyS32 result = k_failure;
    for (auto& turret : m_TurretArray)
    {
        result |= turret->Initialize();
    }
    return result;
}

/******************************************************************************/
/*! 更新
    @param[in]      px    対象の座標X
    @param[in]      py    対象の座標Y
    @return         成功 k_Success, 失敗 それ以外
*******************************************************************************/
MyS32 CTurretArray::Update(MyFloat px, MyFloat py)
{
    MyS32 result = k_failure;
    for (auto& turret : m_TurretArray)
    {
        result |= turret->Update(px, py);
    }
    return result;
}

/******************************************************************************/
/*! オフセット位置の設定
    @param[in]      sx    設定するオフセット位置Ｘ
    @param[in]      sy    設定するオフセット位置Ｙ
*******************************************************************************/
MyVoid CTurretArray::SetOffset(MyFloat sx, MyFloat sy)
{
    for (auto& turret : m_TurretArray)
    {
        turret->SetOffset(sx, sy);
    }
}

/******************************************************************************/
/*! スピードの設定
    @param[in]      sx    設定するスピードＸ
    @param[in]      sy    設定するスピードＹ
*******************************************************************************/
MyVoid CTurretArray::SetSpeed(MyFloat sx, MyFloat sy)
{
    for (auto& turret : m_TurretArray)
    {
        turret->SetSpeed(sx, sy);
    }
}